PublishFor3E/Resources/GetServers.xml

<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><soap:Body><GetArchetypeData xmlns="http://tempuri.org//ServiceExecuteProcess"><selectXml>&lt;SELECT ID="SelectStatement" Class="NextGen.Framework.OQL.Symbols.SelectStatement" xmlns="http://elite.com/schemas/query"&gt;
  &lt;OQL_CONTEXT Class="NextGen.Framework.Managers.ObjectMgr.ExContextProvider"&gt;
    &lt;NODEMAP ID="Node#1" QueryID="NxNtfServer" Class="NextGen.Application.Query.NxNtfServer" Assembly="NextGen.Archetype.NxNtfServer" /&gt;
  &lt;/OQL_CONTEXT&gt;
  &lt;SELECT_LIST&gt;
    &lt;SINGLE_SELECT Union="Distinct"&gt;
      &lt;NODE NodeID="Node#1" /&gt;
      &lt;VALUES&gt;
        &lt;VALUE&gt;
          &lt;LEAF QueryID="ServerName"&gt;
            &lt;NODE NodeID="Node#1" /&gt;
          &lt;/LEAF&gt;
        &lt;/VALUE&gt;
      &lt;/VALUES&gt;
      &lt;WHERE&gt;
        &lt;X_AND_Y&gt;
          &lt;X&gt;
            &lt;X_IS_SIMILAR_TO_Y&gt;
              &lt;X&gt;
                &lt;LEAF QueryID="Instance"&gt;
                  &lt;NODE NodeID="Node#1" /&gt;
                &lt;/LEAF&gt;
              &lt;/X&gt;
              &lt;Y&gt;
                &lt;UNICODE_STRING Value="%%Environment%%" /&gt;
              &lt;/Y&gt;
            &lt;/X_IS_SIMILAR_TO_Y&gt;
          &lt;/X&gt;
          &lt;Y&gt;
            &lt;X_IS_GREATER_THAN_OR_EQUAL_TO_Y&gt;
              &lt;X&gt;
                &lt;LEAF QueryID="LastUpdate"&gt;
                  &lt;NODE NodeID="Node#1" /&gt;
                &lt;/LEAF&gt;
              &lt;/X&gt;
              &lt;Y&gt;
                &lt;X_DATESUB_Y Units="Day"&gt;
                  &lt;X&gt;
                    &lt;CAST&gt;
                      &lt;X&gt;
                        &lt;CURRENT_TIMESTAMP /&gt;
                      &lt;/X&gt;
                      &lt;TYPE&gt;
                        &lt;DATE_TYPE /&gt;
                      &lt;/TYPE&gt;
                    &lt;/CAST&gt;
                  &lt;/X&gt;
                  &lt;Y&gt;
                    &lt;INT_NUM Value="1" /&gt;
                  &lt;/Y&gt;
                &lt;/X_DATESUB_Y&gt;
              &lt;/Y&gt;
            &lt;/X_IS_GREATER_THAN_OR_EQUAL_TO_Y&gt;
          &lt;/Y&gt;
        &lt;/X_AND_Y&gt;
      &lt;/WHERE&gt;
    &lt;/SINGLE_SELECT&gt;
  &lt;/SELECT_LIST&gt;
&lt;/SELECT&gt;
</selectXml></GetArchetypeData></soap:Body></soap:Envelope>